## Terraform Plan Summary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.dev_dav will be created
  + resource "google_storage_bucket" "dev_dav" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "dev-dav"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.dev_log_data will be created
  + resource "google_storage_bucket" "dev_log_data" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "dev-log-data"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.poc_bucket_lab_week will be created
  + resource "google_storage_bucket" "poc_bucket_lab_week" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "poc-bucket-lab-week"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
